tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "real-aazam/aazam"

# Terminal and editor
brew "fish"
brew "neovim"
brew "tmux"
brew "sesh"
brew "starship"
brew "fastfetch"

# Shell and search utilities
brew "carapace"
brew "fd"
brew "fzf"
brew "lazygit"
brew "ripgrep"
brew "shfmt"
brew "stylua"
brew "tree-sitter"

# Languages and runtimes
brew "bun"
brew "go"
brew "pnpm"
brew "rust"
brew "swiftformat"
brew "swiftlint"
brew "uv"
brew "volta"

# DevOps and cloud
brew "act"
brew "autossh"
brew "awscli"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "gh"
brew "kubernetes-cli"
brew "neonctl"
brew "terraform"

# Containers and local infrastructure
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"

# Databases and tooling
brew "mongosh"
brew "mysql"
brew "mysql-client"
brew "ollama"
brew "postgresql@17"
brew "redis"

# Personal / optional CLI
brew "real-aazam/aazam/hollywood"

# Apps
cask "codex"
cask "ghostty"
cask "obsidian"
cask "orbstack"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
